<template>
    <section class="category">
        <h3 class="category-title">
            Название категории
            <span class="category-title-count">(4)</span>
        </h3>

        <ul class="category-list">
            <li class="category-list-item"
                v-for="article in articles"
                :key="article.id"
            >
                <CategoryArticleCard :article="article" />
            </li>
        </ul>
    </section>
</template>

<script>
    import CategoryArticleCard from "@/components/category/CategoryArticleCard";

    export default {
        name: "CardCategory",
        components: {
            CategoryArticleCard
        },

        data() {
            return {
                articles: [
                    {
                        text: 'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.',
                        title: 'Title',
                        likes: 40,
                        img: '/images/category-title.svg'
                    },
                    {
                        text: 'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.',
                        title: 'Title',
                        likes: 40,
                        img: '/images/category-title.svg'
                    },
                    {
                        text: 'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.',
                        title: 'Title',
                        likes: 40,
                        img: '/images/category-title.svg'
                    },
                    {
                        text: 'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.',
                        title: 'Title',
                        likes: 40,
                        img: '/images/category-title.svg'
                    },
                    {
                        text: 'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.',
                        title: 'Title',
                        likes: 40,
                        img: '/images/category-title.svg'
                    },
                    {
                        text: 'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.',
                        title: 'Title',
                        likes: 40,
                        img: '/images/category-title.svg'
                    },
                    {
                        text: 'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.',
                        title: 'Title',
                        likes: 40,
                        img: '/images/category-title.svg'
                    },
                    {
                        text: 'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.',
                        title: 'Title',
                        likes: 40,
                        img: '/images/category-title.svg'
                    }
                ]
            }
        }
    }
</script>

<style lang="less" scoped>
    .category {
        &-list {
            display: flex;
            flex-wrap: wrap;
            gap: 24px;

            &-item {

            }
        }
    }
</style>