<template>
    <div class="categories">
        <div class="categories-header">
            <button class="categories-header-button btn btn-primary">
                Создать категорию
            </button>

            <Search />
        </div>

        <div class="categories-content">

        </div>
    </div>
</template>

<script>
    import Search from "@/components/search/Search";

    export default {
        name: "TheCategories",
        components: {Search},

        data() {
            return {
                listCategories: [
                    {
                        text: 'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.',
                        title: 'Title',
                        likes: 40,
                        img: '/images/category-title.svg'
                    },
                    {
                        text: 'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.',
                        title: 'Title',
                        likes: 40,
                        img: '/images/category-title.svg'
                    },
                    {
                        text: 'Идейные соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании существенных финансовых и административных условий. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки направлений прогрессивного развития.',
                        title: 'Title',
                        likes: 40,
                        img: '/images/category-title.svg'
                    }
                ]
            }
        }
    }
</script>

<style scoped>

</style>